SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_utimer.h
/**************************************************************************//**
 * @file
 * @brief EFR32FG25 UTIMER register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32FG25_UTIMER_H
#define EFR32FG25_UTIMER_H
#define UTIMER_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32FG25_UTIMER UTIMER
 * @{
 * @brief EFR32FG25 UTIMER Register Declaration.
 *****************************************************************************/

/** UTIMER COMP_CH Register Group Declaration. */
typedef struct {
  __IOM uint32_t VAL;                                /**< Compare Value                                      */
  uint32_t       RESERVED0[1U];                      /**< Reserved for future use                            */
} UTIMER_COMP_CH_TypeDef;

/** UTIMER Register Declaration. */
typedef struct {
  __IM uint32_t          IPVERSION;             /**< IP Version                                         */
  __IOM uint32_t         EN;                    /**< Module Enable                                      */
  __IOM uint32_t         SWRST;                 /**< Software Reset                                     */
  __IOM uint32_t         CFG;                   /**< Configuration                                      */
  __IOM uint32_t         CMD;                   /**< Command                                            */
  __IM uint32_t          STATUS;                /**< Status                                             */
  __IOM uint32_t         IF;                    /**< Interrupt Flags                                    */
  __IOM uint32_t         IEN;                   /**< Interrupt Enable                                   */
  __IOM uint32_t         LOCK;                  /**< UTIMER Configuration Lock                          */
  __IOM uint32_t         CNT;                   /**< Counter Value                                      */
  uint32_t               RESERVED0[1U];         /**< Reserved for future use                            */
  UTIMER_COMP_CH_TypeDef COMP_CH[2U];           /**< Comparator Channels                                */
  uint32_t               RESERVED1[1009U];      /**< Reserved for future use                            */
  __IM uint32_t          IPVERSION_SET;         /**< IP Version                                         */
  __IOM uint32_t         EN_SET;                /**< Module Enable                                      */
  __IOM uint32_t         SWRST_SET;             /**< Software Reset                                     */
  __IOM uint32_t         CFG_SET;               /**< Configuration                                      */
  __IOM uint32_t         CMD_SET;               /**< Command                                            */
  __IM uint32_t          STATUS_SET;            /**< Status                                             */
  __IOM uint32_t         IF_SET;                /**< Interrupt Flags                                    */
  __IOM uint32_t         IEN_SET;               /**< Interrupt Enable                                   */
  __IOM uint32_t         LOCK_SET;              /**< UTIMER Configuration Lock                          */
  __IOM uint32_t         CNT_SET;               /**< Counter Value                                      */
  uint32_t               RESERVED2[1U];         /**< Reserved for future use                            */
  UTIMER_COMP_CH_TypeDef COMP_CH_SET[2U];       /**< Comparator Channels                                */
  uint32_t               RESERVED3[1009U];      /**< Reserved for future use                            */
  __IM uint32_t          IPVERSION_CLR;         /**< IP Version                                         */
  __IOM uint32_t         EN_CLR;                /**< Module Enable                                      */
  __IOM uint32_t         SWRST_CLR;             /**< Software Reset                                     */
  __IOM uint32_t         CFG_CLR;               /**< Configuration                                      */
  __IOM uint32_t         CMD_CLR;               /**< Command                                            */
  __IM uint32_t          STATUS_CLR;            /**< Status                                             */
  __IOM uint32_t         IF_CLR;                /**< Interrupt Flags                                    */
  __IOM uint32_t         IEN_CLR;               /**< Interrupt Enable                                   */
  __IOM uint32_t         LOCK_CLR;              /**< UTIMER Configuration Lock                          */
  __IOM uint32_t         CNT_CLR;               /**< Counter Value                                      */
  uint32_t               RESERVED4[1U];         /**< Reserved for future use                            */
  UTIMER_COMP_CH_TypeDef COMP_CH_CLR[2U];       /**< Comparator Channels                                */
  uint32_t               RESERVED5[1009U];      /**< Reserved for future use                            */
  __IM uint32_t          IPVERSION_TGL;         /**< IP Version                                         */
  __IOM uint32_t         EN_TGL;                /**< Module Enable                                      */
  __IOM uint32_t         SWRST_TGL;             /**< Software Reset                                     */
  __IOM uint32_t         CFG_TGL;               /**< Configuration                                      */
  __IOM uint32_t         CMD_TGL;               /**< Command                                            */
  __IM uint32_t          STATUS_TGL;            /**< Status                                             */
  __IOM uint32_t         IF_TGL;                /**< Interrupt Flags                                    */
  __IOM uint32_t         IEN_TGL;               /**< Interrupt Enable                                   */
  __IOM uint32_t         LOCK_TGL;              /**< UTIMER Configuration Lock                          */
  __IOM uint32_t         CNT_TGL;               /**< Counter Value                                      */
  uint32_t               RESERVED6[1U];         /**< Reserved for future use                            */
  UTIMER_COMP_CH_TypeDef COMP_CH_TGL[2U];       /**< Comparator Channels                                */
} UTIMER_TypeDef;
/** @} End of group EFR32FG25_UTIMER */

/**************************************************************************//**
 * @addtogroup EFR32FG25_UTIMER
 * @{
 * @defgroup EFR32FG25_UTIMER_BitFields UTIMER Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for UTIMER IPVERSION */
#define _UTIMER_IPVERSION_RESETVALUE               0x00000001UL                               /**< Default value for UTIMER_IPVERSION          */
#define _UTIMER_IPVERSION_MASK                     0xFFFFFFFFUL                               /**< Mask for UTIMER_IPVERSION                   */
#define _UTIMER_IPVERSION_IPVERSION_SHIFT          0                                          /**< Shift value for UTIMER_IPVERSION            */
#define _UTIMER_IPVERSION_IPVERSION_MASK           0xFFFFFFFFUL                               /**< Bit mask for UTIMER_IPVERSION               */
#define _UTIMER_IPVERSION_IPVERSION_DEFAULT        0x00000001UL                               /**< Mode DEFAULT for UTIMER_IPVERSION           */
#define UTIMER_IPVERSION_IPVERSION_DEFAULT         (_UTIMER_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for UTIMER_IPVERSION   */

