SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_utimer.h
/* Bit fields for UTIMER EN */
#define _UTIMER_EN_RESETVALUE                      0x00000000UL                         /**< Default value for UTIMER_EN                 */
#define _UTIMER_EN_MASK                            0x00000003UL                         /**< Mask for UTIMER_EN                          */
#define UTIMER_EN_EN                               (0x1UL << 0)                         /**< Module enable                               */
#define _UTIMER_EN_EN_SHIFT                        0                                    /**< Shift value for UTIMER_EN                   */
#define _UTIMER_EN_EN_MASK                         0x1UL                                /**< Bit mask for UTIMER_EN                      */
#define _UTIMER_EN_EN_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for UTIMER_EN                  */
#define UTIMER_EN_EN_DEFAULT                       (_UTIMER_EN_EN_DEFAULT << 0)         /**< Shifted mode DEFAULT for UTIMER_EN          */
#define UTIMER_EN_DISABLING                        (0x1UL << 1)                         /**< Disablement Busy Status                     */
#define _UTIMER_EN_DISABLING_SHIFT                 1                                    /**< Shift value for UTIMER_DISABLING            */
#define _UTIMER_EN_DISABLING_MASK                  0x2UL                                /**< Bit mask for UTIMER_DISABLING               */
#define _UTIMER_EN_DISABLING_DEFAULT               0x00000000UL                         /**< Mode DEFAULT for UTIMER_EN                  */
#define UTIMER_EN_DISABLING_DEFAULT                (_UTIMER_EN_DISABLING_DEFAULT << 1)  /**< Shifted mode DEFAULT for UTIMER_EN          */

/* Bit fields for UTIMER SWRST */
#define _UTIMER_SWRST_RESETVALUE                   0x00000000UL                           /**< Default value for UTIMER_SWRST              */
#define _UTIMER_SWRST_MASK                         0x00000003UL                           /**< Mask for UTIMER_SWRST                       */
#define UTIMER_SWRST_SWRST                         (0x1UL << 0)                           /**< Software Reset Command                      */
#define _UTIMER_SWRST_SWRST_SHIFT                  0                                      /**< Shift value for UTIMER_SWRST                */
#define _UTIMER_SWRST_SWRST_MASK                   0x1UL                                  /**< Bit mask for UTIMER_SWRST                   */
#define _UTIMER_SWRST_SWRST_DEFAULT                0x00000000UL                           /**< Mode DEFAULT for UTIMER_SWRST               */
#define UTIMER_SWRST_SWRST_DEFAULT                 (_UTIMER_SWRST_SWRST_DEFAULT << 0)     /**< Shifted mode DEFAULT for UTIMER_SWRST       */
#define UTIMER_SWRST_RESETTING                     (0x1UL << 1)                           /**< Software Reset Busy Status                  */
#define _UTIMER_SWRST_RESETTING_SHIFT              1                                      /**< Shift value for UTIMER_RESETTING            */
#define _UTIMER_SWRST_RESETTING_MASK               0x2UL                                  /**< Bit mask for UTIMER_RESETTING               */
#define _UTIMER_SWRST_RESETTING_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for UTIMER_SWRST               */
#define UTIMER_SWRST_RESETTING_DEFAULT             (_UTIMER_SWRST_RESETTING_DEFAULT << 1) /**< Shifted mode DEFAULT for UTIMER_SWRST       */

/* Bit fields for UTIMER CFG */
#define _UTIMER_CFG_RESETVALUE                     0x00000000UL                         /**< Default value for UTIMER_CFG                */
#define _UTIMER_CFG_MASK                           0x80000140UL                         /**< Mask for UTIMER_CFG                         */
#define UTIMER_CFG_DEBUGRUN                        (0x1UL << 6)                         /**< Debug Mode Run Enable                       */
#define _UTIMER_CFG_DEBUGRUN_SHIFT                 6                                    /**< Shift value for UTIMER_DEBUGRUN             */
#define _UTIMER_CFG_DEBUGRUN_MASK                  0x40UL                               /**< Bit mask for UTIMER_DEBUGRUN                */
#define _UTIMER_CFG_DEBUGRUN_DEFAULT               0x00000000UL                         /**< Mode DEFAULT for UTIMER_CFG                 */
#define _UTIMER_CFG_DEBUGRUN_DISABLE               0x00000000UL                         /**< Mode DISABLE for UTIMER_CFG                 */
#define _UTIMER_CFG_DEBUGRUN_ENABLE                0x00000001UL                         /**< Mode ENABLE for UTIMER_CFG                  */
#define UTIMER_CFG_DEBUGRUN_DEFAULT                (_UTIMER_CFG_DEBUGRUN_DEFAULT << 6)  /**< Shifted mode DEFAULT for UTIMER_CFG         */
#define UTIMER_CFG_DEBUGRUN_DISABLE                (_UTIMER_CFG_DEBUGRUN_DISABLE << 6)  /**< Shifted mode DISABLE for UTIMER_CFG         */
#define UTIMER_CFG_DEBUGRUN_ENABLE                 (_UTIMER_CFG_DEBUGRUN_ENABLE << 6)   /**< Shifted mode ENABLE for UTIMER_CFG          */
#define UTIMER_CFG_CLKSEL                          (0x1UL << 8)                         /**< Clock Source Select                         */
#define _UTIMER_CFG_CLKSEL_SHIFT                   8                                    /**< Shift value for UTIMER_CLKSEL               */
#define _UTIMER_CFG_CLKSEL_MASK                    0x100UL                              /**< Bit mask for UTIMER_CLKSEL                  */
#define _UTIMER_CFG_CLKSEL_DEFAULT                 0x00000000UL                         /**< Mode DEFAULT for UTIMER_CFG                 */
#define _UTIMER_CFG_CLKSEL_HFPERCLK                0x00000000UL                         /**< Mode HFPERCLK for UTIMER_CFG                */
#define _UTIMER_CFG_CLKSEL_PRS                     0x00000001UL                         /**< Mode PRS for UTIMER_CFG                     */
#define UTIMER_CFG_CLKSEL_DEFAULT                  (_UTIMER_CFG_CLKSEL_DEFAULT << 8)    /**< Shifted mode DEFAULT for UTIMER_CFG         */
#define UTIMER_CFG_CLKSEL_HFPERCLK                 (_UTIMER_CFG_CLKSEL_HFPERCLK << 8)   /**< Shifted mode HFPERCLK for UTIMER_CFG        */
#define UTIMER_CFG_CLKSEL_PRS                      (_UTIMER_CFG_CLKSEL_PRS << 8)        /**< Shifted mode PRS for UTIMER_CFG             */
#define UTIMER_CFG_COMP0TOP                        (0x1UL << 31)                        /**< Top Value Select                            */
#define _UTIMER_CFG_COMP0TOP_SHIFT                 31                                   /**< Shift value for UTIMER_COMP0TOP             */
#define _UTIMER_CFG_COMP0TOP_MASK                  0x80000000UL                         /**< Bit mask for UTIMER_COMP0TOP                */
#define _UTIMER_CFG_COMP0TOP_DEFAULT               0x00000000UL                         /**< Mode DEFAULT for UTIMER_CFG                 */
#define _UTIMER_CFG_COMP0TOP_DISABLE               0x00000000UL                         /**< Mode DISABLE for UTIMER_CFG                 */
#define _UTIMER_CFG_COMP0TOP_ENABLE                0x00000001UL                         /**< Mode ENABLE for UTIMER_CFG                  */
#define UTIMER_CFG_COMP0TOP_DEFAULT                (_UTIMER_CFG_COMP0TOP_DEFAULT << 31) /**< Shifted mode DEFAULT for UTIMER_CFG         */
#define UTIMER_CFG_COMP0TOP_DISABLE                (_UTIMER_CFG_COMP0TOP_DISABLE << 31) /**< Shifted mode DISABLE for UTIMER_CFG         */
#define UTIMER_CFG_COMP0TOP_ENABLE                 (_UTIMER_CFG_COMP0TOP_ENABLE << 31)  /**< Shifted mode ENABLE for UTIMER_CFG          */

/* Bit fields for UTIMER CMD */
#define _UTIMER_CMD_RESETVALUE                     0x00000000UL                         /**< Default value for UTIMER_CMD                */
#define _UTIMER_CMD_MASK                           0x00000003UL                         /**< Mask for UTIMER_CMD                         */
#define UTIMER_CMD_START                           (0x1UL << 0)                         /**< Start Timer                                 */
#define _UTIMER_CMD_START_SHIFT                    0                                    /**< Shift value for UTIMER_START                */
#define _UTIMER_CMD_START_MASK                     0x1UL                                /**< Bit mask for UTIMER_START                   */
#define _UTIMER_CMD_START_DEFAULT                  0x00000000UL                         /**< Mode DEFAULT for UTIMER_CMD                 */
#define UTIMER_CMD_START_DEFAULT                   (_UTIMER_CMD_START_DEFAULT << 0)     /**< Shifted mode DEFAULT for UTIMER_CMD         */
#define UTIMER_CMD_STOP                            (0x1UL << 1)                         /**< Stop Timer                                  */
#define _UTIMER_CMD_STOP_SHIFT                     1                                    /**< Shift value for UTIMER_STOP                 */
#define _UTIMER_CMD_STOP_MASK                      0x2UL                                /**< Bit mask for UTIMER_STOP                    */
#define _UTIMER_CMD_STOP_DEFAULT                   0x00000000UL                         /**< Mode DEFAULT for UTIMER_CMD                 */
#define UTIMER_CMD_STOP_DEFAULT                    (_UTIMER_CMD_STOP_DEFAULT << 1)      /**< Shifted mode DEFAULT for UTIMER_CMD         */

/* Bit fields for UTIMER STATUS */
#define _UTIMER_STATUS_RESETVALUE                  0x00000000UL                                   /**< Default value for UTIMER_STATUS             */
#define _UTIMER_STATUS_MASK                        0x00000051UL                                   /**< Mask for UTIMER_STATUS                      */
#define UTIMER_STATUS_RUNNING                      (0x1UL << 0)                                   /**< Running                                     */
#define _UTIMER_STATUS_RUNNING_SHIFT               0                                              /**< Shift value for UTIMER_RUNNING              */
#define _UTIMER_STATUS_RUNNING_MASK                0x1UL                                          /**< Bit mask for UTIMER_RUNNING                 */
#define _UTIMER_STATUS_RUNNING_DEFAULT             0x00000000UL                                   /**< Mode DEFAULT for UTIMER_STATUS              */
#define UTIMER_STATUS_RUNNING_DEFAULT              (_UTIMER_STATUS_RUNNING_DEFAULT << 0)          /**< Shifted mode DEFAULT for UTIMER_STATUS      */
#define UTIMER_STATUS_TIMERLOCKSTATUS              (0x1UL << 4)                                   /**< Timer lock status                           */
#define _UTIMER_STATUS_TIMERLOCKSTATUS_SHIFT       4                                              /**< Shift value for UTIMER_TIMERLOCKSTATUS      */
#define _UTIMER_STATUS_TIMERLOCKSTATUS_MASK        0x10UL                                         /**< Bit mask for UTIMER_TIMERLOCKSTATUS         */
#define _UTIMER_STATUS_TIMERLOCKSTATUS_DEFAULT     0x00000000UL                                   /**< Mode DEFAULT for UTIMER_STATUS              */
#define _UTIMER_STATUS_TIMERLOCKSTATUS_UNLOCKED    0x00000000UL                                   /**< Mode UNLOCKED for UTIMER_STATUS             */
#define _UTIMER_STATUS_TIMERLOCKSTATUS_LOCKED      0x00000001UL                                   /**< Mode LOCKED for UTIMER_STATUS               */
#define UTIMER_STATUS_TIMERLOCKSTATUS_DEFAULT      (_UTIMER_STATUS_TIMERLOCKSTATUS_DEFAULT << 4)  /**< Shifted mode DEFAULT for UTIMER_STATUS      */
#define UTIMER_STATUS_TIMERLOCKSTATUS_UNLOCKED     (_UTIMER_STATUS_TIMERLOCKSTATUS_UNLOCKED << 4) /**< Shifted mode UNLOCKED for UTIMER_STATUS     */
#define UTIMER_STATUS_TIMERLOCKSTATUS_LOCKED       (_UTIMER_STATUS_TIMERLOCKSTATUS_LOCKED << 4)   /**< Shifted mode LOCKED for UTIMER_STATUS       */
#define UTIMER_STATUS_SYNCBUSY                     (0x1UL << 6)                                   /**< Sync Busy                                   */
#define _UTIMER_STATUS_SYNCBUSY_SHIFT              6                                              /**< Shift value for UTIMER_SYNCBUSY             */
#define _UTIMER_STATUS_SYNCBUSY_MASK               0x40UL                                         /**< Bit mask for UTIMER_SYNCBUSY                */
#define _UTIMER_STATUS_SYNCBUSY_DEFAULT            0x00000000UL                                   /**< Mode DEFAULT for UTIMER_STATUS              */
#define UTIMER_STATUS_SYNCBUSY_DEFAULT             (_UTIMER_STATUS_SYNCBUSY_DEFAULT << 6)         /**< Shifted mode DEFAULT for UTIMER_STATUS      */

/* Bit fields for UTIMER IF */
#define _UTIMER_IF_RESETVALUE                      0x00000000UL                         /**< Default value for UTIMER_IF                 */
#define _UTIMER_IF_MASK                            0x00000031UL                         /**< Mask for UTIMER_IF                          */
#define UTIMER_IF_OF                               (0x1UL << 0)                         /**< Overflow Interrupt Flag                     */
#define _UTIMER_IF_OF_SHIFT                        0                                    /**< Shift value for UTIMER_OF                   */
#define _UTIMER_IF_OF_MASK                         0x1UL                                /**< Bit mask for UTIMER_OF                      */
#define _UTIMER_IF_OF_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for UTIMER_IF                  */
#define UTIMER_IF_OF_DEFAULT                       (_UTIMER_IF_OF_DEFAULT << 0)         /**< Shifted mode DEFAULT for UTIMER_IF          */
#define UTIMER_IF_COMP0IF                          (0x1UL << 4)                         /**< Compare Match 0 Interrupt Flag              */
#define _UTIMER_IF_COMP0IF_SHIFT                   4                                    /**< Shift value for UTIMER_COMP0IF              */
#define _UTIMER_IF_COMP0IF_MASK                    0x10UL                               /**< Bit mask for UTIMER_COMP0IF                 */
#define _UTIMER_IF_COMP0IF_DEFAULT                 0x00000000UL                         /**< Mode DEFAULT for UTIMER_IF                  */
#define UTIMER_IF_COMP0IF_DEFAULT                  (_UTIMER_IF_COMP0IF_DEFAULT << 4)    /**< Shifted mode DEFAULT for UTIMER_IF          */
#define UTIMER_IF_COMP1IF                          (0x1UL << 5)                         /**< Compare Match 1 Interrupt Flag              */
#define _UTIMER_IF_COMP1IF_SHIFT                   5                                    /**< Shift value for UTIMER_COMP1IF              */
#define _UTIMER_IF_COMP1IF_MASK                    0x20UL                               /**< Bit mask for UTIMER_COMP1IF                 */
#define _UTIMER_IF_COMP1IF_DEFAULT                 0x00000000UL                         /**< Mode DEFAULT for UTIMER_IF                  */
#define UTIMER_IF_COMP1IF_DEFAULT                  (_UTIMER_IF_COMP1IF_DEFAULT << 5)    /**< Shifted mode DEFAULT for UTIMER_IF          */

