SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_utimer.h
/* Bit fields for UTIMER IEN */
#define _UTIMER_IEN_RESETVALUE                     0x00000000UL                         /**< Default value for UTIMER_IEN                */
#define _UTIMER_IEN_MASK                           0x00000031UL                         /**< Mask for UTIMER_IEN                         */
#define UTIMER_IEN_OF                              (0x1UL << 0)                         /**< Overflow Interrupt Enable                   */
#define _UTIMER_IEN_OF_SHIFT                       0                                    /**< Shift value for UTIMER_OF                   */
#define _UTIMER_IEN_OF_MASK                        0x1UL                                /**< Bit mask for UTIMER_OF                      */
#define _UTIMER_IEN_OF_DEFAULT                     0x00000000UL                         /**< Mode DEFAULT for UTIMER_IEN                 */
#define UTIMER_IEN_OF_DEFAULT                      (_UTIMER_IEN_OF_DEFAULT << 0)        /**< Shifted mode DEFAULT for UTIMER_IEN         */
#define UTIMER_IEN_COMP0IEN                        (0x1UL << 4)                         /**< Compare Match 0 Interrupt Enable            */
#define _UTIMER_IEN_COMP0IEN_SHIFT                 4                                    /**< Shift value for UTIMER_COMP0IEN             */
#define _UTIMER_IEN_COMP0IEN_MASK                  0x10UL                               /**< Bit mask for UTIMER_COMP0IEN                */
#define _UTIMER_IEN_COMP0IEN_DEFAULT               0x00000000UL                         /**< Mode DEFAULT for UTIMER_IEN                 */
#define UTIMER_IEN_COMP0IEN_DEFAULT                (_UTIMER_IEN_COMP0IEN_DEFAULT << 4)  /**< Shifted mode DEFAULT for UTIMER_IEN         */
#define UTIMER_IEN_COMP1IEN                        (0x1UL << 5)                         /**< Compare Match 1 Interrupt Enable            */
#define _UTIMER_IEN_COMP1IEN_SHIFT                 5                                    /**< Shift value for UTIMER_COMP1IEN             */
#define _UTIMER_IEN_COMP1IEN_MASK                  0x20UL                               /**< Bit mask for UTIMER_COMP1IEN                */
#define _UTIMER_IEN_COMP1IEN_DEFAULT               0x00000000UL                         /**< Mode DEFAULT for UTIMER_IEN                 */
#define UTIMER_IEN_COMP1IEN_DEFAULT                (_UTIMER_IEN_COMP1IEN_DEFAULT << 5)  /**< Shifted mode DEFAULT for UTIMER_IEN         */

/* Bit fields for UTIMER LOCK */
#define _UTIMER_LOCK_RESETVALUE                    0x00000000UL                             /**< Default value for UTIMER_LOCK               */
#define _UTIMER_LOCK_MASK                          0x0000FFFFUL                             /**< Mask for UTIMER_LOCK                        */
#define _UTIMER_LOCK_TIMERLOCKKEY_SHIFT            0                                        /**< Shift value for UTIMER_TIMERLOCKKEY         */
#define _UTIMER_LOCK_TIMERLOCKKEY_MASK             0xFFFFUL                                 /**< Bit mask for UTIMER_TIMERLOCKKEY            */
#define _UTIMER_LOCK_TIMERLOCKKEY_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for UTIMER_LOCK                */
#define _UTIMER_LOCK_TIMERLOCKKEY_UNLOCK           0x0000BF91UL                             /**< Mode UNLOCK for UTIMER_LOCK                 */
#define UTIMER_LOCK_TIMERLOCKKEY_DEFAULT           (_UTIMER_LOCK_TIMERLOCKKEY_DEFAULT << 0) /**< Shifted mode DEFAULT for UTIMER_LOCK        */
#define UTIMER_LOCK_TIMERLOCKKEY_UNLOCK            (_UTIMER_LOCK_TIMERLOCKKEY_UNLOCK << 0)  /**< Shifted mode UNLOCK for UTIMER_LOCK         */

/* Bit fields for UTIMER CNT */
#define _UTIMER_CNT_RESETVALUE                     0x00000000UL                         /**< Default value for UTIMER_CNT                */
#define _UTIMER_CNT_MASK                           0xFFFFFFFFUL                         /**< Mask for UTIMER_CNT                         */
#define _UTIMER_CNT_CNT_SHIFT                      0                                    /**< Shift value for UTIMER_CNT                  */
#define _UTIMER_CNT_CNT_MASK                       0xFFFFFFFFUL                         /**< Bit mask for UTIMER_CNT                     */
#define _UTIMER_CNT_CNT_DEFAULT                    0x00000000UL                         /**< Mode DEFAULT for UTIMER_CNT                 */
#define UTIMER_CNT_CNT_DEFAULT                     (_UTIMER_CNT_CNT_DEFAULT << 0)       /**< Shifted mode DEFAULT for UTIMER_CNT         */

/* Bit fields for UTIMER COMPVAL */
#define _UTIMER_COMPVAL_RESETVALUE                 0x00000000UL                         /**< Default value for UTIMER_COMPVAL            */
#define _UTIMER_COMPVAL_MASK                       0xFFFFFFFFUL                         /**< Mask for UTIMER_COMPVAL                     */
#define _UTIMER_COMPVAL_COMP_SHIFT                 0                                    /**< Shift value for UTIMER_COMP                 */
#define _UTIMER_COMPVAL_COMP_MASK                  0xFFFFFFFFUL                         /**< Bit mask for UTIMER_COMP                    */
#define _UTIMER_COMPVAL_COMP_DEFAULT               0x00000000UL                         /**< Mode DEFAULT for UTIMER_COMPVAL             */
#define UTIMER_COMPVAL_COMP_DEFAULT                (_UTIMER_COMPVAL_COMP_DEFAULT << 0)  /**< Shifted mode DEFAULT for UTIMER_COMPVAL     */

/** @} End of group EFR32FG25_UTIMER_BitFields */
/** @} End of group EFR32FG25_UTIMER */
/** @} End of group Parts */

#endif /* EFR32FG25_UTIMER_H */
